Revit 2026 API

# IntersectionResultDistance Property

---

Distance from the original object to located point.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Distance { get; }
```
```vb
Public ReadOnly Property Distance As Double
	Get
```
```cpp
public:
property double Distance {
	double get ();
}
```
```fsharp
member Distance : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown in the getter when this property has not been set by the method providing the result. |

#### Reference

IntersectionResult Class

Autodesk.Revit.DB Namespace